package sec03.chap10;
// 비트연산자
public class Main {
    static void main() {
        // & | ^  << ??
        // & |는 단축평가를 하지 않는다.

        int x = 5;              // 00101
        int y = 19;             // 10011

        int x_xor_y = 5 ^ 19;   // 10110
        int x_or_y = 5 | 19;    // 10111
        int x_and_y = 5 & 19;   // 00001

        int not_X = ~5;         // 11111111 11111010    // -(5+1)
        int not_Y = ~19;        // 11111111 11101100    // -(19+1)

        int x_L_1 = 5 << 1;     // 01010    // 5*2
        int y_L_1 = 19 << 1;    // 100110   // 19*2

        int x_R_1 = 5 >> 1;     // 00010    // 5/2 몫
        int y_R_1 = 19 >> 1;    // 001001   // 19/2 몫

    }
}
